In [3]:
import numpy as np
import pandas as pd

# DATAFRAMES

A DataFrame represents a rectangular table of data and contains an ordered **collection of columns**, each of which can be a different value type (numeric, string, boolean, etc.). 

The DataFrame has both row and column index; Each column is a Series with a name. Each row can be thought of as a dict of Series all sharing the same index (row label), but each value has a diff key (the col name).

## Creating dataframes

Can create dataframes from many types of data

In [1283]:
#from a series
states =['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
aseries = pd.Series([2000, 2001, 2002, 2001, 2002, 2003], index = states)

aseries.to_frame()

           0
Ohio    2000
Ohio    2001
Ohio    2002
Nevada  2001
Nevada  2002
Nevada  2003

In [4]:
#from a dict containing list as values, key are used as col labels
import pandas as pd
dictoflist = {'lab': ['A', 'A', 'B', 'C', 'D', 'D'],
        'val1': [10, 20, 30, 40, 50, 60],
        'val2': [True, True, True, False, True, False]}
adf = pd.DataFrame(dictoflist)
adf

  lab  val1   val2
0   A    10   True
1   A    20   True
2   B    30   True
3   C    40  False
4   D    50   True
5   D    60  False

In [10]:
#adf['val1'].groupby(adf['val2']).mean()
adf['lab'].groupby(adf['val2']).value_counts()

val2   lab
False  C      1
       D      1
True   A      2
       B      1
       D      1
Name: lab, dtype: int64

In [6]:
#we can reorder columns using the columns parameter
#adding a col label that doesnt match those in the data source
#create a value of NaN

statepopDF = pd.DataFrame(dictoflist, 
                columns = ['year', 'state', 'pop'])
statepopDF

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

When  pandas  determines  that  a  series  holds  numeric values, but it cannot find a number to represent an entry, it will use NaN.\
This value stands for Not A Number, and is usually ignored in arithmetic operations.

In [1286]:
#From a dict containing dicts as values
#once again, the key is use as col label
#the inner keys are used as row(index) labels
#when some values are missing for a given row it used NaN

dictofdicts = {'Ohio': {2000 : 1.5, 2001 : 1.7, 2002 : 3.6},
               'Nevada': {2001: 2.4, 2002 : 2.9, 2003 : 3.2}}
newDF1 = pd.DataFrame(dictofdicts)
newDF1

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.2

In [1287]:
#From a dict of Pandas Series
#keys are used as col names, values in each Series become columns

dictofSeries = {'one' : pd.Series(['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']),
                'two': pd.Series([2000, 2001, 2002, 2001, 2002, 2003]),
                'three' : pd.Series([1.5, 1.7, 3.6, 2.4, 2.9, 3.2])}

newDF2 = pd.DataFrame(dictofSeries)
newDF2

      one   two  three
0    Ohio  2000    1.5
1    Ohio  2001    1.7
2    Ohio  2002    3.6
3  Nevada  2001    2.4
4  Nevada  2002    2.9
5  Nevada  2003    3.2

In [1288]:
#rename columns
newDF2.columns = ['state','year','pop']
newDF2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [1289]:
#From a list of dict
#dict entries are treated as rows with keys as column names
listofdict= [{'state':'Ohio', 'year': 2000, 'pop':1.5},
             {'state':'Ohio', 'year': 2001, 'pop':1.7},
            {'state':'Ohio', 'year': 2002, 'pop':3.6}]
newDF3 = pd.DataFrame(listofdict)
newDF3

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001
2  3.6  Ohio  2002

In [1290]:
#From an existing DataFrame
newDF4 = pd.DataFrame(newDF3, 
            index = [1, 2, 3, 4], 
            columns = ['state', 'year'])
newDF4

  state    year
1  Ohio  2001.0
2  Ohio  2002.0
3   NaN     NaN
4   NaN     NaN

In [1291]:
#we can also read from csv or other files (pd.read_csv())

## some useful attributes of DataFrame

In [1292]:
statepopDF.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['year', 'state', 'pop'], dtype='object')]

In [1293]:
statepopDF.columns

Index(['year', 'state', 'pop'], dtype='object')

In [1294]:
statepopDF.index

RangeIndex(start=0, stop=6, step=1)

In [1295]:
#returns a NumPy ndarray
newDF1.values

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9],
       [nan, 3.2]])

In [1296]:
newDF1.shape

(4, 2)

In [1297]:
newDF1.index.is_unique

True

In [1298]:
newDF1.index.is_monotonic

True

In [1299]:
newDF1.index.unique()

Int64Index([2000, 2001, 2002, 2003], dtype='int64')

In [1300]:
newDF1.columns.is_unique

True

In [1301]:
newDF1.columns.is_monotonic

False

In [1302]:
newDF1.dtypes

Ohio      float64
Nevada    float64
dtype: object

## Accessing/selecting an entire column (Series)  - indexing

Any Series operations can be performed on a column

In [1303]:
#USE THIS, the better approach- works for all col names
statepopDF['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [1304]:
#we can provide a list of col labels
statepopDF[['year', 'pop']]

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9
5  2003  3.2

In [1305]:
#Another approach - NOT RECOMMENDED.
#This only works for well-formed col names (no spaces etc)

statepopDF.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [1306]:
statepopDF['state'].str.upper()

0      OHIO
1      OHIO
2      OHIO
3    NEVADA
4    NEVADA
5    NEVADA
Name: state, dtype: object

## Accessing/selecting rows

In [1307]:
newDF1

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.2

In [1308]:
#DataFrame's .iloc() allows us to provide row indices by location (0,1,...)

newDF1.iloc[0]

Ohio      1.5
Nevada    NaN
Name: 2000, dtype: float64

Slicing with labels behaves differently than normal Python slicing      in that the endpoint is inclusive

In [1309]:
newDF1.loc[2000:2002]

C:\Users\u0625859\Anaconda\anaconda3\lib\site-packages\IPython\core\displayhook.py:276: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  'Flushing oldest {cull_count} entries.'.format(sz=sz, cull_count=cull_count))

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [1310]:
#can use slicing
newDF1.iloc[0 : 10: 2 ]

      Ohio  Nevada
2000   1.5     NaN
2002   3.6     2.9

In [1311]:
#in reality you dont have to specify .iloc() - it is used for clarity
#to be clear that we are requesting
newDF1[0:10:2]

      Ohio  Nevada
2000   1.5     NaN
2002   3.6     2.9

In [1312]:
#can use .iloc[] with fancy indexing
newDF3.iloc[[0,2]]

   pop state  year
0  1.5  Ohio  2000
2  3.6  Ohio  2002

In [1313]:
#another way to access rows is using loc()
#which uses the label of the location instead of location as index
newDF1.loc[2000]

Ohio      1.5
Nevada    NaN
Name: 2000, dtype: float64

In [1314]:
#we can use fancy indexing, recall that means we use [] to specify the index
#because we are using loc, we specify the row index by name
#dont use strings for the index name, just the label

newDF1.loc[[2001, 2003]]

      Ohio  Nevada
2001   1.7     2.4
2003   NaN     3.2

In [1315]:
#we can use slicing
newDF1.loc[2001 : 2003]

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.2

In [1316]:
#we can also use lambda functions to determine the rows
newDF1.loc[lambda row : row.index % 2 ==0]

      Ohio  Nevada
2000   1.5     NaN
2002   3.6     2.9

In [1317]:
#Note: if you extract just one column, it is no longer a Dataframe
#so you cant use .loc[], .iloc[]
#It is a series, so you can use series indexing

#print the population mean for Ohio when Nevada's values are < 3 (2 years)

print(newDF1['Ohio'][newDF1['Nevada'] <3])
newDF1['Ohio'][newDF1['Nevada'] <3].mean()

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

2.65

## Accessing/selecting a subset of the table using col/row indices

In [1318]:
#to select a single value, use at[]
# index for multiple axes are separated by ,

newDF1.at[2000, 'Ohio']

1.5

In [1319]:
#use .iat[] for integer indexes for both axes
newDF1.iat[0, 0]

1.5

In [1320]:
#you can also use .loc[] and .iloc[] which work for one or more values

newDF1.loc[2000, 'Ohio']

1.5

In [1321]:
newDF1.iloc[0, 0]

1.5

In [1322]:
newDF1.iloc[[0,3], [0, 1]]

      Ohio  Nevada
2000   1.5     NaN
2003   NaN     3.2

In [1323]:
newDF1.loc[:,['Nevada']]

      Nevada
2000     NaN
2001     2.4
2002     2.9
2003     3.2

In [1324]:
#col labels are string, index/row labels are not
newDF1.loc[2001 : 2003, ['Ohio']]

      Ohio
2001   1.7
2002   3.6
2003   NaN

In [1325]:
newDF1.xs('Ohio', axis = 1)

2000    1.5
2001    1.7
2002    3.6
2003    NaN
Name: Ohio, dtype: float64

In [1410]:
newDF1.xs(2001)

Ohio      1.7
Nevada    2.4
Name: 2001, dtype: float64

## Adding new columns

In [1327]:
#adding a new column adds to original DF
statepopDF['eastern'] = statepopDF['state'] == 'Ohio'
statepopDF

   year   state  pop  eastern
0  2000    Ohio  1.5     True
1  2001    Ohio  1.7     True
2  2002    Ohio  3.6     True
3  2001  Nevada  2.4    False
4  2002  Nevada  2.9    False
5  2003  Nevada  3.2    False

In [1328]:
#for math and stats, we can use NumPy operations
statepopDF['logpop'] = np.log(statepopDF['pop'])
statepopDF

   year   state  pop  eastern    logpop
0  2000    Ohio  1.5     True  0.405465
1  2001    Ohio  1.7     True  0.530628
2  2002    Ohio  3.6     True  1.280934
3  2001  Nevada  2.4    False  0.875469
4  2002  Nevada  2.9    False  1.064711
5  2003  Nevada  3.2    False  1.163151

In [1329]:
#create a new col of NaN values
statepopDF['someval'] = ''
statepopDF

   year   state  pop  eastern    logpop someval
0  2000    Ohio  1.5     True  0.405465
1  2001    Ohio  1.7     True  0.530628
2  2002    Ohio  3.6     True  1.280934
3  2001  Nevada  2.4    False  0.875469
4  2002  Nevada  2.9    False  1.064711
5  2003  Nevada  3.2    False  1.163151

In [1330]:
#statepopDF = statepopDF.drop(columns='Dummy')
#notice we use ~ for negation
statepopDF.insert(1, 'Dummy', ~statepopDF['eastern'])

In [1331]:
statepopDF

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.5     True  0.405465
1  2001  False    Ohio  1.7     True  0.530628
2  2002  False    Ohio  3.6     True  1.280934
3  2001   True  Nevada  2.4    False  0.875469
4  2002   True  Nevada  2.9    False  1.064711
5  2003   True  Nevada  3.2    False  1.163151

## Adding new rows

In [1332]:
aseries = pd.Series({'year':2004,
                 'Dummy' : True, 
                 'state' : 'Nevada', 
                 'pop' : 3.5, 
                 'eastern' : False, 
                 'logpop' : 0,
                 'someval' : "C"})
print(aseries)
statepopDF.append(aseries, ignore_index = True)   
#to append a series, we have to specify ignore_index = True

year         2004
Dummy        True
state      Nevada
pop           3.5
eastern     False
logpop          0
someval         C
dtype: object

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.5     True  0.405465
1  2001  False    Ohio  1.7     True  0.530628
2  2002  False    Ohio  3.6     True  1.280934
3  2001   True  Nevada  2.4    False  0.875469
4  2002   True  Nevada  2.9    False  1.064711
5  2003   True  Nevada  3.2    False  1.163151
6  2004   True  Nevada  3.5    False  0.000000       C

In [1333]:
statepopDF.loc[6] = [2005, True, 'Nevada', 4.2, False, np.nan, "B"]
statepopDF

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.5     True  0.405465
1  2001  False    Ohio  1.7     True  0.530628
2  2002  False    Ohio  3.6     True  1.280934
3  2001   True  Nevada  2.4    False  0.875469
4  2002   True  Nevada  2.9    False  1.064711
5  2003   True  Nevada  3.2    False  1.163151
6  2005   True  Nevada  4.2    False       NaN       B

## Setting values

be careful, as it changes the original DataFrame

In [1334]:
#enclose connditions in ()
#use & for elementwise AND and | for elementwise OR

statepopDF.loc[(statepopDF['year']< 2002)&
               (statepopDF['eastern']==True), 'someval'] = "A"
statepopDF

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.5     True  0.405465       A
1  2001  False    Ohio  1.7     True  0.530628       A
2  2002  False    Ohio  3.6     True  1.280934
3  2001   True  Nevada  2.4    False  0.875469
4  2002   True  Nevada  2.9    False  1.064711
5  2003   True  Nevada  3.2    False  1.163151
6  2005   True  Nevada  4.2    False       NaN       B

In [1335]:
#when the row index is already 0,1,... iloc[] doesnt work
statepopDF.loc[4, ['someval']] = 'C'
statepopDF

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.5     True  0.405465       A
1  2001  False    Ohio  1.7     True  0.530628       A
2  2002  False    Ohio  3.6     True  1.280934
3  2001   True  Nevada  2.4    False  0.875469
4  2002   True  Nevada  2.9    False  1.064711       C
5  2003   True  Nevada  3.2    False  1.163151
6  2005   True  Nevada  4.2    False       NaN       B

In [1336]:
statepopDF['someval']= pd.Series(['A', 'B','B','A', 'A', 'B', 'B'])
statepopDF

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.5     True  0.405465       A
1  2001  False    Ohio  1.7     True  0.530628       B
2  2002  False    Ohio  3.6     True  1.280934       B
3  2001   True  Nevada  2.4    False  0.875469       A
4  2002   True  Nevada  2.9    False  1.064711       A
5  2003   True  Nevada  3.2    False  1.163151       B
6  2005   True  Nevada  4.2    False       NaN       B

## Iteration over elements

In [1337]:
'state' in statepopDF.index

False

In [1338]:
'state' in statepopDF.columns

True

In [1339]:
for elem in statepopDF :    #goes over column names
    print(elem)

year
Dummy
state
pop
eastern
logpop
someval

In [1340]:
# .iteritems() goes over each column and returns a Series object for each

for ind, col in statepopDF.iteritems() :
    print(ind, ':', col)

year : 0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
6    2005
Name: year, dtype: int64
Dummy : 0    False
1    False
2    False
3     True
4     True
5     True
6     True
Name: Dummy, dtype: bool
state : 0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
6    Nevada
Name: state, dtype: object
pop : 0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
6    4.2
Name: pop, dtype: float64
eastern : 0     True
1     True
2     True
3    False
4    False
5    False
6    False
Name: eastern, dtype: bool
logpop : 0    0.405465
1    0.530628
2    1.280934
3    0.875469
4    1.064711
5    1.163151
6         NaN
Name: logpop, dtype: float64
someval : 0    A
1    B
2    B
3    A
4    A
5    B
6    B
Name: someval, dtype: object

In [1341]:
# if you want to loop over all rows
for row in statepopDF.iterrows() :
    print (row)

(0, year           2000
Dummy         False
state          Ohio
pop             1.5
eastern        True
logpop     0.405465
someval           A
Name: 0, dtype: object)
(1, year           2001
Dummy         False
state          Ohio
pop             1.7
eastern        True
logpop     0.530628
someval           B
Name: 1, dtype: object)
(2, year          2002
Dummy        False
state         Ohio
pop            3.6
eastern       True
logpop     1.28093
someval          B
Name: 2, dtype: object)
(3, year           2001
Dummy          True
state        Nevada
pop             2.4
eastern       False
logpop     0.875469
someval           A
Name: 3, dtype: object)
(4, year          2002
Dummy         True
state       Nevada
pop            2.9
eastern      False
logpop     1.06471
someval          A
Name: 4, dtype: object)
(5, year          2003
Dummy         True
state       Nevada
pop            3.2
eastern      False
logpop     1.16315
someval          B
Name: 5, dtype: object)
(6, year         2005
Dummy        True
state      Nevada
pop           4.2
eastern     False
logpop        NaN
someval         B
Name: 6, dtype: object)

## METHODS/ FUNCTIONS

## info()

In [1342]:
statepopDF.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 7 columns):
year       7 non-null int64
Dummy      7 non-null bool
state      7 non-null object
pop        7 non-null float64
eastern    7 non-null bool
logpop     6 non-null float64
someval    7 non-null object
dtypes: bool(2), float64(2), int64(1), object(2)
memory usage: 670.0+ bytes

## isnull(), notnull()

In [1343]:
statepopDF.isnull()

    year  Dummy  state    pop  eastern  logpop  someval
0  False  False  False  False    False   False    False
1  False  False  False  False    False   False    False
2  False  False  False  False    False   False    False
3  False  False  False  False    False   False    False
4  False  False  False  False    False   False    False
5  False  False  False  False    False   False    False
6  False  False  False  False    False    True    False

## astype()

In [1344]:
#we can use category as a dtype(it is not numeric, but nomimal values - no order)
statepopDF['year'].astype('category')

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
6    2005
Name: year, dtype: category
Categories (5, int64): [2000, 2001, 2002, 2003, 2005]

## count() and value_counts()

In [1345]:
#length of the whole DF
len(statepopDF)   # number of rows

7

In [1346]:
statepopDF.count()    #number of non NaN values

year       7
Dummy      7
state      7
pop        7
eastern    7
logpop     6
someval    7
dtype: int64

In [1347]:
#NaN values are ignored
statepopDF['pop'].count()

7

In [9]:
#good for categorical data
statepopDF['state'].value_counts()

Ohio      3
Nevada    3
Name: state, dtype: int64

## reindex()

conforms the data to a new index and/or columns\
we can pull out select rows and column from existing DataFrame and also create new rows and columns

In [1349]:
#We can choose which index values (rows) to keep
#creates a new DF

newstatepopDF = statepopDF.reindex([4,3,2,1,7], 
                fill_value=-1, 
                columns=['year', 'state', 'pop', 'new'])
newstatepopDF

   year   state  pop  new
4  2002  Nevada  2.9   -1
3  2001  Nevada  2.4   -1
2  2002    Ohio  3.6   -1
1  2001    Ohio  1.7   -1
7    -1      -1 -1.0   -1

## set_index(), reset_index()

In [1350]:
#we can create a new index from an existing column
#here we create a multi-index

statepopmultiDF = statepopDF.set_index(['year', 'state'])
statepopmultiDF

             Dummy  pop  eastern    logpop someval
year state
2000 Ohio    False  1.5     True  0.405465       A
2001 Ohio    False  1.7     True  0.530628       B
2002 Ohio    False  3.6     True  1.280934       B
2001 Nevada   True  2.4    False  0.875469       A
2002 Nevada   True  2.9    False  1.064711       A
2003 Nevada   True  3.2    False  1.163151       B
2005 Nevada   True  4.2    False       NaN       B

In [1351]:
#to add an incrementing integer index
statepopmultiDF.reset_index()

   year   state  Dummy  pop  eastern    logpop someval
0  2000    Ohio  False  1.5     True  0.405465       A
1  2001    Ohio  False  1.7     True  0.530628       B
2  2002    Ohio  False  3.6     True  1.280934       B
3  2001  Nevada   True  2.4    False  0.875469       A
4  2002  Nevada   True  2.9    False  1.064711       A
5  2003  Nevada   True  3.2    False  1.163151       B
6  2005  Nevada   True  4.2    False       NaN       B

## drop() and pop()

In [1352]:
#dropping a column creates a new DF
#by default drop works on axis 0(rows)

newstatepopDF.drop([7])

   year   state  pop  new
4  2002  Nevada  2.9   -1
3  2001  Nevada  2.4   -1
2  2002    Ohio  3.6   -1
1  2001    Ohio  1.7   -1

In [1353]:
#we have to specify axis =1 for col

newstatepop.drop(['new'], axis=1)

   year   state  pop
4  2002  Nevada  2.9
3  2001  Nevada  2.4
2  2002    Ohio  3.6
1  2001    Ohio  1.7
7    -1      -1 -1.0

## transpose() and swapaxes()

In [1354]:
#From a NumPy array
ndarr = np.array([['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        [2000, 2001, 2002, 2001, 2002, 2003],                
        [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]])

#for this data, default index names are 0,1,...
statespopDF2 = pd.DataFrame(ndarr)
statespopDF2

      0     1     2       3       4       5
0  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
1  2000  2001  2002    2001    2002    2003
2   1.5   1.7   3.6     2.4     2.9     3.2

In [1355]:
#for this data, we can provide index names
statespopDF2 = pd.DataFrame(ndarr, index =['state', 'year', 'pop'])
statespopDF2

          0     1     2       3       4       5
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
year   2000  2001  2002    2001    2002    2003
pop     1.5   1.7   3.6     2.4     2.9     3.2

In [1356]:
#transpose creates a new DF
statespopDF2_1 = statespop2.transpose()
statespopDF2_1

        0     1    2
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## sort_values() and sort_index

Any missing values are sorted to the end of the Series by default

In [1357]:
#sort by year first then by state
statepopDF.sort_values(['year', 'state'])

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.5     True  0.405465       A
3  2001   True  Nevada  2.4    False  0.875469       A
1  2001  False    Ohio  1.7     True  0.530628       B
4  2002   True  Nevada  2.9    False  1.064711       A
2  2002  False    Ohio  3.6     True  1.280934       B
5  2003   True  Nevada  3.2    False  1.163151       B
6  2005   True  Nevada  4.2    False       NaN       B

In [1358]:
#sort the DF by logpop 
#show me the rows with three largest values of logpop
statepopDF.sort_values(['logpop'])[-3:]

   year  Dummy   state  pop  eastern    logpop someval
5  2003   True  Nevada  3.2    False  1.163151       B
2  2002  False    Ohio  3.6     True  1.280934       B
6  2005   True  Nevada  4.2    False       NaN       B

In [1359]:
#sort on the index instead.
statepopDF.sort_index(ascending=False)

   year  Dummy   state  pop  eastern    logpop someval
6  2005   True  Nevada  4.2    False       NaN       B
5  2003   True  Nevada  3.2    False  1.163151       B
4  2002   True  Nevada  2.9    False  1.064711       A
3  2001   True  Nevada  2.4    False  0.875469       A
2  2002  False    Ohio  3.6     True  1.280934       B
1  2001  False    Ohio  1.7     True  0.530628       B
0  2000  False    Ohio  1.5     True  0.405465       A

## rename()

In [1360]:
#store ints and their squares in a dict
#dict comprehension
somedict = {x : x**2 for x in range(11)}
somedict

{0: 0, 1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

In [1361]:
#rename takes a dict with old values:new values
statepopDF.rename(columns={x : x.capitalize() for x in statepopDF.columns}, inplace=False)

   Year  Dummy   State  Pop  Eastern    Logpop Someval
0  2000  False    Ohio  1.5     True  0.405465       A
1  2001  False    Ohio  1.7     True  0.530628       B
2  2002  False    Ohio  3.6     True  1.280934       B
3  2001   True  Nevada  2.4    False  0.875469       A
4  2002   True  Nevada  2.9    False  1.064711       A
5  2003   True  Nevada  3.2    False  1.163151       B
6  2005   True  Nevada  4.2    False       NaN       B

In [1362]:
statepopDF.rename(index = {x : x+2 for x in statepopDF.index})

   year  Dummy   state  pop  eastern    logpop someval
2  2000  False    Ohio  1.5     True  0.405465       A
3  2001  False    Ohio  1.7     True  0.530628       B
4  2002  False    Ohio  3.6     True  1.280934       B
5  2001   True  Nevada  2.4    False  0.875469       A
6  2002   True  Nevada  2.9    False  1.064711       A
7  2003   True  Nevada  3.2    False  1.163151       B
8  2005   True  Nevada  4.2    False       NaN       B

## replace()

instead of setting values by index, we can use replace() to change values of things that match patterns specified as regexp

to_replace can be str, regex, list, dict, Series, int, float, or None

In [1363]:
statepopDF.replace(to_replace=['Ohio', 'Maine'], value=['OHIO', 'NJ'])

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    OHIO  1.5     True  0.405465       A
1  2001  False    OHIO  1.7     True  0.530628       B
2  2002  False    OHIO  3.6     True  1.280934       B
3  2001   True  Nevada  2.4    False  0.875469       A
4  2002   True  Nevada  2.9    False  1.064711       A
5  2003   True  Nevada  3.2    False  1.163151       B
6  2005   True  Nevada  4.2    False       NaN       B

## Set operations on indexes or columns

can use these to compare row/indexes or column labels across DFs

In [2]:
newDF3

NameError: name 'newDF3' is not defined

In [1]:
newDF3["pop"]

NameError: name 'newDF3' is not defined

In [1365]:
newDF4

  state    year
1  Ohio  2001.0
2  Ohio  2002.0
3   NaN     NaN
4   NaN     NaN

In [1369]:
#concat() - requires a list or dict of Pandas objects to be concatenated
#options are
#axis - 0 is along rows, 1 is along columns
#many others....

In [1370]:
dictoflist = {'state': ['Utah', 'Utah', 'Utah', 'Georgia', 'Georgia', 'Georgia'],
        'year': [2000, 2001, 2002, 2000, 2001, 2003],
        'pop': [0.8, 1.0, 1.1, 2, 2.2, 2.8]}
anotherpopDF = pd.DataFrame(dictoflist)
anotherpopDF

     state  year  pop
0     Utah  2000  0.8
1     Utah  2001  1.0
2     Utah  2002  1.1
3  Georgia  2000  2.0
4  Georgia  2001  2.2
5  Georgia  2003  2.8

In [1371]:
pd.concat([statepopDF, anotherpopDF], sort=False).reset_index()

    index  year  Dummy    state  pop eastern    logpop someval
0       0  2000  False     Ohio  1.5    True  0.405465       A
1       1  2001  False     Ohio  1.7    True  0.530628       B
2       2  2002  False     Ohio  3.6    True  1.280934       B
3       3  2001   True   Nevada  2.4   False  0.875469       A
4       4  2002   True   Nevada  2.9   False  1.064711       A
5       5  2003   True   Nevada  3.2   False  1.163151       B
6       6  2005   True   Nevada  4.2   False       NaN       B
7       0  2000    NaN     Utah  0.8     NaN       NaN     NaN
8       1  2001    NaN     Utah  1.0     NaN       NaN     NaN
9       2  2002    NaN     Utah  1.1     NaN       NaN     NaN
10      3  2000    NaN  Georgia  2.0     NaN       NaN     NaN
11      4  2001    NaN  Georgia  2.2     NaN       NaN     NaN
12      5  2003    NaN  Georgia  2.8     NaN       NaN     NaN

In [1372]:
#merge() has options 
#on : to specify the common column to be used as key for merge
       #can pass a list of column names to on to merge on multiple keys
#how : to specify inner (only matched keys) or outer joins (all keys) for values to be kept
       #or 'right' join (all values from right) or 'left join' (all values from left)
#suffixes : to specify a tuple of suffix to append to the common join column names, default (_x, _y)
#indicator : to indicate source of merge with values, 'left_only', 'right_only' or 'both'

#right_index : if True, use the index of the right DF as its key, default False
#left_index : if True, use the index of the left DF as its key, default False
#also can be used along with

#left_on : to specify the key(s) of the left DF
#right_on : to specify the key(s) of the right DF

In [1373]:
dictoflist = {'state': ['Ohio', 'Ohio', 'Nevada'],
        'year': [2000, 2002, 2003],
        'event': [1, 2, 3]}
thirdpopDF = pd.DataFrame(dictoflist)
thirdpopDF

    state  year  event
0    Ohio  2000      1
1    Ohio  2002      2
2  Nevada  2003      3

In [1374]:
statepopDF.merge(thirdpopDF, on =['state', 'year'], how='inner')

   year  Dummy   state  pop  eastern    logpop someval  event
0  2000  False    Ohio  1.5     True  0.405465       A      1
1  2002  False    Ohio  3.6     True  1.280934       B      2
2  2003   True  Nevada  3.2    False  1.163151       B      3

In [1375]:
amergedDF = statepopDF.merge(thirdpopDF, on =['state', 'year'], how='outer')
amergedDF

   year  Dummy   state  pop  eastern    logpop someval  event
0  2000  False    Ohio  1.5     True  0.405465       A    1.0
1  2001  False    Ohio  1.7     True  0.530628       B    NaN
2  2002  False    Ohio  3.6     True  1.280934       B    2.0
3  2001   True  Nevada  2.4    False  0.875469       A    NaN
4  2002   True  Nevada  2.9    False  1.064711       A    NaN
5  2003   True  Nevada  3.2    False  1.163151       B    3.0
6  2005   True  Nevada  4.2    False       NaN       B    NaN

### Fill in missing values

In [1376]:
# this will replace all nan values with a given value
amergedDF.fillna(amergedDF['event'].mean())

   year  Dummy   state  pop  eastern    logpop someval  event
0  2000  False    Ohio  1.5     True  0.405465       A    1.0
1  2001  False    Ohio  1.7     True  0.530628       B    2.0
2  2002  False    Ohio  3.6     True  1.280934       B    2.0
3  2001   True  Nevada  2.4    False  0.875469       A    2.0
4  2002   True  Nevada  2.9    False  1.064711       A    2.0
5  2003   True  Nevada  3.2    False  1.163151       B    3.0
6  2005   True  Nevada  4.2    False  2.000000       B    2.0

In [1377]:
#we can send in a dict with  column names as keys
# to specify a diff fill value for diff columns
amergedDF.fillna({'event': amergedDF['event'].mean(), 'logpop' : 0})

   year  Dummy   state  pop  eastern    logpop someval  event
0  2000  False    Ohio  1.5     True  0.405465       A    1.0
1  2001  False    Ohio  1.7     True  0.530628       B    2.0
2  2002  False    Ohio  3.6     True  1.280934       B    2.0
3  2001   True  Nevada  2.4    False  0.875469       A    2.0
4  2002   True  Nevada  2.9    False  1.064711       A    2.0
5  2003   True  Nevada  3.2    False  1.163151       B    3.0
6  2005   True  Nevada  4.2    False  0.000000       B    2.0

## apply() and applymap()

DataFrame.apply() operates on entire rows or columns at a time.

DataFrame.applymap() (like Series.apply() and Series.map()) operate on one element at time.

Both only accept functions as input parameters

apply() is for applying any function that cannot be vectorised using - built-in NumPy functions; can perform aggregations across all values (min, max, etc)

applymap() is good for transformations of elements across entire rows or columns (e.g., df[['A', 'B', 'C']].applymap(str.strip))

In [1378]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

statepopDF[['pop' , 'year']].apply(f)

     pop  year
min  1.5  2000
max  4.2  2005

In [1379]:
statepopDF[['pop']].applymap(lambda x: np.add(x, .2))

   pop
0  1.7
1  1.9
2  3.8
3  2.6
4  3.1
5  3.4
6  4.4

In [1380]:
statepopDF[['pop']] = statepopDF[['pop']] + 0.2
statepopDF

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.7     True  0.405465       A
1  2001  False    Ohio  1.9     True  0.530628       B
2  2002  False    Ohio  3.8     True  1.280934       B
3  2001   True  Nevada  2.6    False  0.875469       A
4  2002   True  Nevada  3.1    False  1.064711       A
5  2003   True  Nevada  3.4    False  1.163151       B
6  2005   True  Nevada  4.4    False       NaN       B

In [1381]:
#since we obtain a single col, it is a Series
#to do elementwise function, use map() on Series and applymap() on DF

statepopDF['logpop'].map(lambda val : '%.2f' %val)

0    0.41
1    0.53
2    1.28
3    0.88
4    1.06
5    1.16
6     nan
Name: logpop, dtype: object

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

## Group operations 

### groupby()

In [1414]:
#Note that it is safer to call the column by DF['colname']
#If the column was selected as one of the columns then we dont need
#groupby([DF['colname']]), we can use groupby('colname')

#use [] when the columns selected or the groupby have more than one.

statepopDF['pop'].groupby(statepopDF['state']).mean()

state
Nevada    3.375000
Ohio      2.466667
Name: pop, dtype: float64

In [1405]:
statepopDF[['pop', 'state']].groupby('state').mean()

             pop
state
Nevada  3.375000
Ohio    2.466667

In [1383]:
statepopDF

   year  Dummy   state  pop  eastern    logpop someval
0  2000  False    Ohio  1.7     True  0.405465       A
1  2001  False    Ohio  1.9     True  0.530628       B
2  2002  False    Ohio  3.8     True  1.280934       B
3  2001   True  Nevada  2.6    False  0.875469       A
4  2002   True  Nevada  3.1    False  1.064711       A
5  2003   True  Nevada  3.4    False  1.163151       B
6  2005   True  Nevada  4.4    False       NaN       B

In [1384]:
#after grouping we can call any builtin aggregation function
#note here, we can only call one this way
#see agg() for an alternate approach to call many functions
statepopDF[['pop', 'logpop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .median()

                 pop    logpop
someval state
A       Nevada  2.85  0.970090
        Ohio    1.70  0.405465
B       Nevada  3.90  1.163151
        Ohio    2.85  0.905781

In [1385]:
#after groupby() size() gives us the size of each grouping
statepopDF[['pop', 'logpop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .size()

someval  state
A        Nevada    2
         Ohio      1
B        Nevada    2
         Ohio      2
dtype: int64

In [1386]:
#if we want to specify many builtin aggregate functions, we can do so
#by providing a list of function names as strings
#or their NumPy name, e.g., np.mean() or 'mean'
statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .agg([np.mean, 'median', 'min', 'max', 'first', 'last', 'var', 'std', 'sum', 'prod'])

                 pop
                mean median  min  max first last    var       std  sum   prod
someval state
A       Nevada  2.85   2.85  2.6  3.1   2.6  3.1  0.125  0.353553  5.7   8.06
        Ohio    1.70   1.70  1.7  1.7   1.7  1.7    NaN       NaN  1.7   1.70
B       Nevada  3.90   3.90  3.4  4.4   3.4  4.4  0.500  0.707107  7.8  14.96
        Ohio    2.85   2.85  1.9  3.8   1.9  3.8  1.805  1.343503  5.7   7.22

In [1387]:
#we can also call describe() and call .T or transpose() to view it differently
statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .describe().T

someval           A              B
state        Nevada Ohio    Nevada      Ohio
pop count  2.000000  1.0  2.000000  2.000000
    mean   2.850000  1.7  3.900000  2.850000
    std    0.353553  NaN  0.707107  1.343503
    min    2.600000  1.7  3.400000  1.900000
    25%    2.725000  1.7  3.650000  2.375000
    50%    2.850000  1.7  3.900000  2.850000
    75%    2.975000  1.7  4.150000  3.325000
    max    3.100000  1.7  4.400000  3.800000

In [1415]:
#after groupby(), we usually call some aggregation function 
#like count(), min(), max(), sum()
#we can also write our own custom function by calling .agg() 
#and giving it a function

statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .agg(lambda x : x.max() - x.min())

                pop
someval state
A       Nevada  0.5
        Ohio    0.0
B       Nevada  1.0
        Ohio    1.9

In [1416]:
#note that apply also gives us the same result
#apply() respects the groupby vars because the function
#inside apply is an aggregation
statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .apply(lambda x : x.max() - x.min())

C:\Users\u0625859\Anaconda\anaconda3\lib\site-packages\pandas\core\groupby\groupby.py:4315: FutureWarning: arrays to stack must be passed as a "sequence" type such as list or tuple. Support for non-sequence iterables such as generators is deprecated as of NumPy 1.16 and will raise an error in the future.
  stacked_values = np.vstack(map(np.asarray, values))

                pop
someval state
A       Nevada  0.5
        Ohio    0.0
B       Nevada  1.0
        Ohio    1.9

In [1390]:
#depending on the function (if it is elementwise) apply flattens out
# the result and ignores the groupby vars

statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .apply(lambda x : x+2)

   pop
0  3.7
1  3.9
2  5.8
3  4.6
4  5.1
5  5.4
6  6.4

In [1391]:
#if we just want good old integer indexing instead of hierarchical
#index, we can call reset_index
statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .apply(lambda x : x.max() - x.min()).reset_index()

  someval   state  pop
0       A  Nevada  0.5
1       A    Ohio  0.0
2       B  Nevada  1.0
3       B    Ohio  1.9

### Pivoting tables

when we have multiple levels of indices, we can **unstack()** to get a wide format or **stack()** to get a long format

level specifies whether we want to use the outeror leftmost (level=0) index or inner or right index (level =1,...)

In [1392]:
#pivot
statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .apply(lambda x : x.max() - x.min()).unstack(level = 1)

           pop
state   Nevada Ohio
someval
A          0.5  0.0
B          1.0  1.9

In [1393]:
#pivot
statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .apply(lambda x : x.max() - x.min()).unstack(level = 0)

         pop
someval    A    B
state
Nevada   0.5  1.0
Ohio     0.0  1.9

In [1394]:
#pivot
statepopDF[['pop']]\
    .groupby([statepopDF['someval'],statepopDF['state']])\
    .apply(lambda x : x.max() - x.min()).unstack(level = 1).stack()

                pop
someval state
A       Nevada  0.5
        Ohio    0.0
B       Nevada  1.0
        Ohio    1.9

## Arithmetic

recall broadcasting/ vectorization

In [1417]:
statepopDF['pop'].add (2)

0    3.7
1    3.9
2    5.8
3    4.6
4    5.1
5    5.4
6    6.4
Name: pop, dtype: float64

In [1396]:
statepopDF['logpop'].mul(statepopDF['pop'])

0    0.689291
1    1.008194
2    4.867549
3    2.276219
4    3.300603
5    3.954713
6         NaN
dtype: float64

In [1397]:
# can also do sub, div, floordiv, and pow

## Descriptive statistics

These are also called **reductions** or summary statistics - methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame.

They have built-in handling for missing data.

There are also **accumulations**- cumulative stats.

In [1398]:
statepopDF.describe()

              year       pop    logpop
count     7.000000  7.000000  6.000000
mean   2002.000000  2.985714  0.886726
std       1.632993  0.985611  0.352713
min    2000.000000  1.700000  0.405465
25%    2001.000000  2.250000  0.616838
50%    2002.000000  3.100000  0.970090
75%    2002.500000  3.600000  1.138541
max    2005.000000  4.400000  1.280934

In [1399]:
statepopDF.mean()

year       2002.000000
Dummy         0.571429
pop           2.985714
eastern       0.428571
logpop        0.886726
dtype: float64

In [1419]:
#get the index of the max value - also idxmin()
statepopDF['pop'].idxmax()

6

In [1401]:
print(statepopDF.mean(), end="\n\n")
print(statepopDF.median(), end="\n\n")
print(statepopDF.max(), end="\n\n")
print(statepopDF.min(), end="\n\n")
print(statepopDF.quantile([0.1,.9]), end="\n\n")

print(statepopDF.var(), end="\n\n")
print(statepopDF.std(), end="\n\n")
print(statepopDF.mad(), end="\n\n")
print(statepopDF.skew(), end="\n\n")    #positive means longer right tail
print(statepopDF.kurt(), end="\n\n")    #how narrow is the peak (larger number more narrow)

year       2002.000000
Dummy         0.571429
pop           2.985714
eastern       0.428571
logpop        0.886726
dtype: float64

year       2002.00000
Dummy         1.00000
pop           3.10000
eastern       0.00000
logpop        0.97009
dtype: float64

year          2005
Dummy         True
state         Ohio
pop            4.4
eastern       True
logpop     1.28093
someval          B
dtype: object

year           2000
Dummy         False
state        Nevada
pop             1.7
eastern       False
logpop     0.405465
someval           A
dtype: object

       year  Dummy   pop  eastern    logpop
0.1  2000.6    0.0  1.82      0.0  0.468047
0.9  2003.8    1.0  4.04      1.0  1.222042

year       2.666667
Dummy      0.285714
pop        0.971429
eastern    0.285714
logpop     0.124407
dtype: float64

year       1.632993
Dummy      0.534522
pop        0.985611
eastern    0.534522
logpop     0.352713
dtype: float64

year       1.142857
Dummy      0.489796
pop        0.787755
eastern    0.489796
logpop     0.282872
dtype: float64

year       0.964487
Dummy     -0.374166
pop       -0.005163
eastern    0.374166
logpop    -0.469028
dtype: float64

year       1.162500
Dummy     -2.800000
pop       -1.140019
eastern   -2.800000
logpop    -1.694823
dtype: float64